{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello! How may I help you.",
        "Good day",
        "How are you doing",
        "Hello"
      ],
      "responses": [
        "Hey :-)",
        "Hello",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye"
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thank's a lot!",
        "We Appreciate"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure"
      ]
    },
    {
      "tag": "items",
      "patterns": [
        "Which items do you have?",
        "What kinds of items are there?",
        "What do you sell?",
        "What do you have?"
      ],
      "responses": [
        "We sell Coffee Classics, Hot Drinks, Shakes & Frappe,Baked Goods, Sweet Treats, Savory Eats.Browse through each section to discover your perfect choice!,You can type 'menu' to view the prices of items",
        "We have Coffee Classics, Hot Drinks, Shakes & Frappe,Baked Goods, Sweet Treats, Savory Eats.Browse through each section to discover your perfect choice!,You can type 'menu' to view the prices of items",
        "We have a diverse menu featuring categorized sections like Coffee Classics,Hot drinks,Shakes & Frappe, Cold Drinks, Baked Goods, Sweet Treats, and Savory Eats. Browse through each section to discover your perfect choice!,You can type 'menu' to view the prices of items"
      ]
    },
    {
      "tag": "request-cafe-hours",
      "patterns": [
        "Can you tell me the timings of your cafe",
        "I'd like to know the hours of your cafe",
        "Do you have opening hours for your cafe",
        "Do you have hours of operation for your cafe",
        "What time is your cafe open today",
        "When can I visit your cafe",
        "What are your hours of operation?",
        "When are you open?",
        "Are you open today?",
        "What are your opening and closing times?"
      ],
      "responses": [
        "Our hours of operation are 10:00 AM to 10:00 PM.",
        "We are open 10:00 AM to 10:00 PM.",
        "Today we are open from 10:00 AM to 10:00 PM."
      ]
    },
    {
      "tag":"feedback",
      "patterns":[
        "Excellent service!",
        "Outstanding service!",
        "This is amazing service!",
        "This is the best service I've had in a long time.",
        "Thanks to you, everything is working perfectly now.",
        "You really helped me out of a jam.",
        "I'm very satisfied with the service I received.",
        "make some improvements",
        "That was incredibly fast service."
      ],
      "responses":
      [
        "Thanks for the feedback"
      ]

    },
    {
      "tag": "location",
      "patterns": [
        "Where are you located?",
        "What's your address?",
        "Can you tell me where place is?",
        "location"
      ],
      "responses": [
        "We are located at calhoun Street,Houston,TX,77056."
      ]
    },
    {
      "tag": "Coffee items",
      "patterns": [
        "Coffee Classics",
        "May i know the list of items under coffee classics",
        "Excuse me, could you tell me what coffees are included in the Coffee Classics section?",
        "May I inquire about the list of beverages under Coffee Classics?",
        "I'm interested in the Coffee Classics. Could you provide me with a list of the available options?",
        "Coffee items"
      ],
      "responses": [
        "We offer Macchiato,Cappuccino, Americano, Cafe Au Lait, Latte Macchiato, Wiener Melange, Don Panna, Buck Coffee,Espresso,Cafe Latte, Iced Coffee"
      ]
    },
    {
      "tag": "Shakes & Frappe",
      "patterns": [
        "Excuse me, could you tell me what shakes and frappes you have available?",
        "May I inquire about the flavors offered in the Shakes & Frappe section?",
        "I'm interested in your selection of shakes and frappes. Could you provide me with a list of the available options?"
      ],
      "responses": [
        "Avocado Shake,Drumstick Milkshake,Pumpkin Shake,Malted Chocolate,Oreo Shake,Cotton Candy Shake,Frappe"
      ]
    },
    {
      "tag": "Shakes",
      "patterns": [
        "Excuse me, could you tell me what shakes you have available?",
        "May I inquire about the flavors offered in the Shakes section?",
        "I'm interested in your selection of shakes. Could you provide me with a list of the available options?",
        "Shakes"
      ],
      "responses": [
        "Avocado Shake,Drumstick Milkshake,Pumpkin Shake,Malted Chocolate,Oreo Shake,Cotton Candy Shake,Frappe"
      ]
    },
    {
      "tag": "Cold_Drinks",
      "patterns": [
        "Excuse me, could you tell me what refreshing cold beverages you offer?",
        "May I inquire about the selection of non-blended cold drinks on your menu?",
        "I'd like to see what chilled options you have beyond blended drinks. Could you provide me with a list?",
        "Cold drinks"

      ],
      "responses": [
        "Apple Pomegranate Juice,Cranberry Orange,Mint White Chocolate,Cherry Vanilla,Peanut Vanilla,Smores"
      ]
    },
    {
      "tag": "Baked goods",
      "patterns": [
        "Hey, what kind of puffs do you have in your Baked Goods section?",
        "What puffs do you have today? I'm in the mood for something flaky!",
        "Can I see what puff pastries you have on the menu?",
        "Excuse me, could you tell me what puff pastries you have available?",
        "May I inquire about the selection of puff within the Baked Goods section?",
        "I'm interested in your puffs. Could you provide me with a list of the flavors you offer?"
      ],
      "responses": [
        "Blueberry Puff,Nutella Puff,Asparagus Puff,Egg Puff,Rough Puff,Simple Cherry Puff,Cinnamon Orange Rolls,French Pastry,Croissant (cheese and plain flavors)"
      ]
    },
    {
      "tag": "Sweet Treats",
      "patterns": [
        "Excuse me, could you tell me what desserts you offer in the Sweet Treats section?",
        "May I inquire about the selection of sweet treats on your menu?",
        "I'd like to see what delicious desserts you have available. Could you provide me with a list of the items under Sweet Treats?",
        "Hey, what kind of desserts do you have in your Sweet Treats section?",
        "What's in the Sweet Treats section? I'm craving something sweet!",
        "Can I see what sweet treats you have on the menu?"
      ],
      "responses": [
        "Red Velvet Cake,Strawberry Tiramisu,Black Forest Cake,Black Tie Mousse,Pineapple Shortcake"
      ]
    },
    {
      "tag": "Savory treats",
      "patterns": [
        "Excuse me, could you tell me what savory options you offer in the Savory Eats section?",
        "May I inquire about the selection of savory dishes on your menu?",
        "I'd like to explore your options for savory snacks or meals. Could you provide me with a list of the items under Savory Eats?",
        "Hey, what kind of savory stuff do you have in your Savory Eats section?",
        "What's in the Savory Eats section? I'm feeling a bit peckish!",
        "Can I see what savory options you have on the menu?"
      ],
      "responses": [
        "Salted Caramel Pretzel,Char Siu Bao,Spinach Pastry,Beef Wellington,Keto Pull Apart Bread,Tart Social,Blaster Teriyaki Pulled Pork,Waffle (low-cream and chocolate flavors)"
      ]
    },
    {
      "tag": "popular_items",
      "patterns": [
        "which items do you recommend",
        "What are your bestsellers?",
        "Which dishes do people usually order?",
        "Can you recommend some popular items from your menu?",
        "What are the most popular dishes here?",
        "Which dishes are your specialties?",
        "Do you have any customer favorites?",
        "Are there any dishes that everyone loves?",
        "Which items are highly recommended?",
        "What are the top picks from your menu?",
        "Can you tell me what's popular among customers?",
	      "Can you suggest some popular items",
	      "can you recommend popular items on menu",
        "Which dishes do people usually order?",
        "Can you recommend some popular items from your menu?",
        "What are the most popular dishes here?",
        "What are the most famous dishes here?"
      ],
      "responses": [
        "Some of our customer favorites are Mint White Chocolate,Malted Chocolate,Salted Caramel Pretzel,Irish Coffee,Macrons,You can type 'menu' to view the prices of items, 'order <item>' to order an item,"
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "Do you take credit cards?",
        "Do you accept Mastercard?",
        "Can I pay with Paypal?",
        "Are you cash only?"
      ],
      "responses": [
        "We accept VISA, Mastercard and Paypal",
        "We accept most major credit cards, and Paypal",
        "we dont accept cash"
      ]
    },
    {
      "tag": "Coffee_Items",
      "patterns": [
        "What types of coffee do you serve?",
        "Do you have any specialty coffee drinks?",
        "Can you describe your signature coffee?",
        "Do you offer single-origin coffees?",
        "What brewing methods do you use for your coffee?",
        "Do you serve espresso-based drinks?",
        "Are there any unique or seasonal coffee options?",
        "Can you recommend a strong coffee?",
        "Do you have any lighter or milder coffee options?",
        "Are your coffee beans sourced locally or internationally?",
        "Can I try a sample of your different coffee varieties?",
        "Do you offer any flavored coffees?",
        "Are there any organic or fair trade coffee options?",
        "Do you serve cold brew coffee?",
        "Are your coffee drinks customizable in terms of strength and size?",
        "Do you have any decaffeinated coffee options?",
        "Are there any coffee blends or mixes available?",
        "Can you explain the differences between your various coffee drinks?",
        "Do you offer any educational sessions or tastings to learn about your coffee?",
        "Can I purchase your coffee beans to brew at home?"
      ],
      "responses": [
        "Certainly! Our coffee menu offers a variety of options to suit different preferences. From classic choices like Simple Coffee and Black Coffee to specialty drinks like Cappuccino, Americano, and Latte Macchiato, we strive to provide a diverse selection for our customers. Whether you prefer your coffee hot or cold, with or without milk, we have something for everyone."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    },
    {
      "tag": "Vegan_Options",
      "patterns": [
        "Do you have any vegan smoothies?",
        "Which of your desserts are dairy-free?",
        "Are there any vegan options suitable for breakfast?",
        "Can you suggest a vegan dish that is rich in fiber?",
        "Do you offer any plant-based snacks?",
        "Are your salads vegan-friendly?",
        "Which of your sandwiches can be made vegan?",
        "Are there any vegan options on your appetizer menu?",
        "Can you recommend a vegan dish that is filling and satisfying?",
        "Do you have any vegan options that are also gluten-free?",
        "Are there any vegan soups available?",
        "Which of your side dishes are vegan?",
        "Do you offer any vegan-friendly beverages?"
      ],
      "responses": [
        "We offer a range of vegan shakes like Avocado and Pumpkin, along with desserts such as Cranberry Orange pastry and Nutella Puff. For low-calorie options, we recommend Tomato Cheese waffle and Easy Spinach pastry. Our Mix Fruit Smoothie is a great high-protein vegan dish choice. Enjoy!"
      ]
    },
    {
      "tag": "Nut_Allergies",
      "patterns": [
        "Do you have any dishes that contain gluten?",
        "Are your desserts suitable for people with lactose intolerance?",
        "Which items on your menu are free from soy?",
        "Do you offer any options for customers with egg allergies?",
        "Are there any dishes that are suitable for vegans and gluten-free?",
        "Do you use any seafood ingredients in your dishes?",
        "Are your shakes made with dairy milk or plant-based alternatives?",
        "Can you accommodate customers with specific food allergies if notified in advance?",
        "Do you offer any low-sodium options for customers watching their salt intake?",
        "Are your ingredients locally sourced and organic?"
      ],
      "responses": [
        "Absolutely! We offer gluten-free options on our menu.Yes, our desserts are lactose-free, suitable for those with lactose intolerance."
      ]
    },
    {
      "tag": "Soy-Free Options",
      "patterns": [
        "Which dishes on your menu are soy-free?",
        "Do you use soybean oil in any of your cooking?",
        "Are there any soy-free options for your drinks?",
        "Can you recommend a soy-free dish that is also gluten-free?",
        "Are your salad dressings and sauces made without soy?",
        "Do you offer any soy-free alternatives for protein sources?",
        "Are your snacks and appetizers free from soy ingredients?",
        "Do you have any desserts that do not contain soy products?",
        "Are your cooking methods separate for soy-free dishes?",
        "Can I customize a dish to be soy-free if it normally contains soy?"
      ],
      "responses": [
        "Yes, we offer soy-free options on our menu."
      ]
    },
    {
      "tag": "Sugar-Free Desserts",
      "patterns": [
        "Which desserts do not contain added sugars?",
        "Do you use artificial sweeteners in any of your sugar-free desserts?",
        "Are your sugar-free options suitable for diabetics?",
        "Do you have any desserts sweetened with natural fruit juices instead of sugar?"
      ],
      "responses": [
        "Yes, we have desserts without added sugars, like fruit salads.No, we don't use artificial sweeteners in our sugar-free desserts.Our sugar-free options are safe for diabetics.Some desserts are sweetened with natural fruit juices instead of sugar."
      ]
    },

    {
      "tag": "Order_Item",
      "patterns": [
        "Can I have a [item_name]",
        "Can I get a [item_name]",
        "Can I order a [item_name]?",
        "I'd like to order [item_name].",
        "I want [item_name], please.",
        "Can I order a Smores",
        "How much does the Avocado Shake cost",
        "What's the price of the Mix Fruit Smoothie?",
        "How much is the Black Tie Mocha?",
        "What's the price range for your coffees?",
        "How can I place an order?",
        "Do you offer delivery services?",
        "Can I order online?",
        "What's the process for takeout?",
        "Can I order black coffee",
        "Can I order Frappe",
        "Can I order Pumpkin Shake",
        "Can I order Oreo Shake",
        "Can I order Pista Shake",
        "Can I have Black Tie Mose",
        "Can I get Maxres Special",
        "I want Smores, please.",
        "I want to order Pista Shake, please."

      ],
      "responses": [
        "You can type 'menu' to view the menu and its prices, 'order item_name' to order an item, 'add quantity item_name' to add an item to your cart, 'checkout' to proceed to checkout, or 'exit' to exit the chatbot.",
        "You can type 'menu' to see our offerings and its prices, 'order item_name' to select an item, 'add quantity item_names' to add to your cart, 'checkout' to complete your order, or 'exit' to leave the chat."
      ]
    },
    {
      "tag": "Menu_Items",
      "patterns": [
        "What do you have on the menu?",
        "Can you show me the menu?",
        "What dishes do you offer?",
        "Do you have any desserts?"
      ],
      "responses": [
        "We have a diverse selection of dishes ranging from appetizers to desserts. You can type 'menu' to browse"
      ]
    }
  ]
}